STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Commissioning/STM32_WPAN/App/app_thread.c
  if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success)
  {
    APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
  }
  else
  {
    APP_DBG("**********************************************************");
    APP_DBG("WIRELESS COPROCESSOR FW:");
    /* Print version */
    APP_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor, p_wireless_info->VersionMinor, p_wireless_info->VersionSub);

    switch(p_wireless_info->StackType)
    {
    case INFO_STACK_TYPE_THREAD_FTD :
      APP_DBG("FW Type : Thread FTD");
      break;
    case INFO_STACK_TYPE_THREAD_MTD :
      APP_DBG("FW Type : Thread MTD");
      break;
    case INFO_STACK_TYPE_BLE_THREAD_FTD_STATIC :
      APP_DBG("FW Type : Static Concurrent Mode BLE/Thread");
      break;
    default :
      /* No Thread device supported ! */
      APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
      break;
    }
    APP_DBG("**********************************************************");
  }
}
/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
/**
 * @brief  Period elapsed callback
 * @param  none
 * @retval None
 */
static void APP_THREAD_TimingElapsed(void)
{
  static uint32_t internalFlag = 0;

  internalFlag++;
  if (internalFlag >= 4U)
    internalFlag = 0;

  switch(ToggleBlueLedMode)
  {
  case FAST_TOGGLING : BSP_LED_Toggle(LED1);
  break;

  case SLOW_TOGGLING : if (internalFlag == 0)
    BSP_LED_Toggle(LED1);
  break;
  default : break;
  }
}

static void CommissionerStateCallback(otCommissionerState aState, void *aContext)
{
  APP_DBG("otCommissionerStateCallback");

  switch (aState)
  {
  case OT_COMMISSIONER_STATE_DISABLED:
    APP_DBG("Commissioner : disabled\r\n");
    break;
  case OT_COMMISSIONER_STATE_PETITION:
    APP_DBG("Commissioner : petitioning\r\n");
    break;
  case OT_COMMISSIONER_STATE_ACTIVE:
    APP_DBG("Commissioner : active\r\n");
    break;
  }
}

static void OutputBytes(const uint8_t *aBytes, uint8_t aLength)
{
  for (int i = 0; i < aLength; i++)
  {
    APP_DBG("%02x", aBytes[i]);
  }
}

static void CommissionerJoinerCallback(otCommissionerJoinerEvent aEvent, const otJoinerInfo * aJoinerInfo, const otExtAddress *aJoinerId, void *aContext)
{
  APP_DBG("Commissioner: Joiner ");

  switch (aEvent)
  {
  case OT_COMMISSIONER_JOINER_START:
      APP_DBG("start ");
      break;
  case OT_COMMISSIONER_JOINER_CONNECTED:
      APP_DBG("connect ");
      break;
  case OT_COMMISSIONER_JOINER_FINALIZE:
      APP_DBG("finalize ");
      break;
  case OT_COMMISSIONER_JOINER_END:
      APP_DBG("end ");
      break;
  case OT_COMMISSIONER_JOINER_REMOVED:
      APP_DBG("remove ");
      break;
  }

  OutputBytes(aJoinerId->m8, sizeof(*aJoinerId));
}


/**
 * @brief Commissioner configuration.
 *        This function starts and configure the commissioner.
 * @param  None
 * @retval None
 */
static void APP_THREAD_StartCommissioner(void)
{
  otError error;

  HAL_Delay(1000U);
  APP_DBG("APP_THREAD_StartCommissioner");
  /* Start the commissioner */
  error = otCommissionerStart(NULL,
      CommissionerStateCallback,
      CommissionerJoinerCallback,
      NULL);

  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_COMMISSIONER_START, error);
  }

  /* Authorize external devices to join */
  error = otCommissionerAddJoiner(NULL,  /* otInstance */
      NULL,        /* aEui64 */
      C_PASSWORD,  /* aPskd */
      120U);       /* aTimeout */
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_COMMISSIONER_CONFIG, error);
  }
}

/**
 * @brief Commissioner configuration.
 *        This function starts and configures the commissioner.
 * @param  None
 * @retval None
 */
static void APP_THREAD_ConfigLeaderDevice(void)
{
  otError error;

  APP_DBG("APP_THREAD_ConfigLeaderDevice");

  error = otLinkSetChannel(NULL, C_CHANNEL_NB);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_CHANNEL, error);
  }
  error = otLinkSetPanId(NULL, C_PANID);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_PANID, error);
  }
  error = otIp6SetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE, error);
  }
  error = otThreadSetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_START, error);
  }
  APP_THREAD_DeviceIsLeader = TRUE;
}

/**
 * @brief Joiner configuration.
 *        This function starts and configures the joiner.
 * @param  None
 * @retval None
 */
static void APP_THREAD_ConfigJoiner(void)
{
  otError error;

  APP_DBG("APP_THREAD_ConfigJoiner");
  ToggleBlueLedMode = FAST_TOGGLING;
  error = otIp6SetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE, error);
  }

  /* Start the commissioner */
  error = otJoinerStart(NULL,   /* otInstance */
      C_PASSWORD,               /* aPskd */
      NULL,                     /* aProvisioningUrl */
      "OT",                     /* aVendorName */
      "TestAppli",              /* aVendorModel */
      "NA",                     /* aVendorSwVersion */
      NULL,                     /* aVendorData */
      APP_THREAD_JoinerHandler, /* otJoinerCallback aCallback */
      NULL);                    /* aContext */

  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_JOINER_START, error);
  }
}

/**
 * @brief Dummy request handler
 * @param
 * @retval None
 */
static void APP_THREAD_JoinerHandler(otError OtError, void *pContext)
{
  if (OtError == OT_ERROR_NONE)
  {
    OtError = otThreadSetEnabled(NULL, true);
    if (OtError != OT_ERROR_NONE)
    {
      APP_THREAD_Error(ERR_THREAD_START, OtError);
    }
    APP_DBG("JOIN SUCCESS!");
  }
  else
    APP_THREAD_Error(ERR_THREAD_JOINER_CB, OtError);
}
/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void APP_THREAD_RegisterCmdBuffer(TL_CmdPacket_t* p_buffer)
{
  p_thread_otcmdbuffer = p_buffer;
}

Thread_OT_Cmd_Request_t* THREAD_Get_OTCmdPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)p_thread_otcmdbuffer->cmdserial.cmd.payload;
}

Thread_OT_Cmd_Request_t* THREAD_Get_OTCmdRspPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)((TL_EvtPacket_t *)p_thread_otcmdbuffer)->evtserial.evt.payload;
}

